app/views/projects/index.html.erb

SELECT `updates`.* FROM `updates` WHERE (`updates`.project_id = 1) ORDER BY updates.id DESC LIMIT 1
---
<% @projects.each do |project| %>
  <% update = project.updates.find(:last) %>