app/controllers/projects_controller.rb

SELECT `projects`.* FROM `projects` WHERE (status = 'live') ORDER BY name ASC, client
---
  def index
    @projects = Project.all(:order => 'status ASC, name ASC, client')

SELECT `projects`.* FROM `projects` WHERE (`projects`.`id` = 1) LIMIT 1
---
  def show
    @project = Project.find(params[:id])

SELECT `projects`.* FROM `projects` WHERE (`projects`.`id` = 2) LIMIT 1
---
  def edit
    @project = Project.find(params[:id])

INSERT INTO `projects` (`client`, `created_at`, `name`, `status`, `updated_at`) VALUES ('Atlanta', '2010-11-15 17:32:36', 'Regional System Map', 'pending', '2010-11-15 17:32:36')
---
  def create
    @project = Project.new(params[:project])

    respond_to do |format|
      if @project.save

SELECT `projects`.* FROM `projects` WHERE (`projects`.`id` = 2) LIMIT 1
UPDATE `projects` SET `client` = 'NYC DOT', `name` = 'Transportation Feedback Portals', `updated_at` = '2010-11-09 22:27:24' WHERE (`projects`.`id` = 2)
---
  def update
    @project = Project.find(params[:id])

    respond_to do |format|
      if @project.update_attributes(params[:project])