app/controllers/updates_controller.rb

SELECT `updates`.* FROM `updates`
---
  def index
    @updates = Update.all

SELECT `updates`.* FROM `updates` WHERE (`updates`.`id` = 1) LIMIT 1
---
  def show
    @update = Update.find(params[:id])

INSERT INTO `updates` (`author`, `created_at`, `mood`, `project_id`, `text`, `updated_at`) VALUES (NULL, '2010-11-15 16:22:00', 'happy', 7, 'Hi', '2010-11-15 16:22:00')
---
  def create
    @update = Update.new(params[:update])

    respond_to do |format|
      if @update.save